# CheckSection

Check section base class

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.check_section import CheckSection

# TODO update the JSON string below
json = "{}"
# create an instance of CheckSection from a JSON string
check_section_instance = CheckSection.from_json(json)
# print the JSON string representation of the object
print(CheckSection.to_json())

# convert the object into a dict
check_section_dict = check_section_instance.to_dict()
# create an instance of CheckSection from a dict
check_section_from_dict = CheckSection.from_dict(check_section_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)